EDTTask51/src/Documents/SalesInvoice/SalesInvoice.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SalesInvoice</name>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDTTask51/src/Documents/SalesInvoice/Forms/DocumentForm/Module.bsl
#Region FormTableItemsEventHandlersItemList
&AtClient
Procedure ItemListPriceOnChange(Item)
	CurrentData = Items.ItemList.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;	
	CalculateAmount(CurrentData);
EndProcedure

&AtClient
Procedure ItemListQuantityOnChange(Item)
	CurrentData = Items.ItemList.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	CalculateAmount(CurrentData);
EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure CalculateAmount(TableRow)
	TableRow.Amount = TableRow.Price * TableRow.Quantity;	
EndProcedure

#EndRegion
